#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.transitgateway.data.aws_route_table.this[0]: Refreshing state... [id=rtb-0756202060a1ad43e]
module.transitgateway.data.aws_route_table.this[2]: Refreshing state... [id=rtb-f12b7397]
module.transitgateway.data.aws_ec2_transit_gateway_vpc_attachments.this: Refreshing state... [id=ap-southeast-1]
module.transitgateway.data.aws_route_table.this[1]: Refreshing state... [id=rtb-0af206f562131c35d]
module.transitgateway.data.aws_organizations_organization.this[0]: Refreshing state... [id=o-4cce9csu7z]
module.transitgateway.data.aws_vpc.new_vpc_cidr[0]: Refreshing state... [id=vpc-0c9cd8eed5980b262]
module.transitgateway.data.aws_vpc.new_vpc_cidr[1]: Refreshing state... [id=vpc-c38256a5]
module.transitgateway.aws_ec2_transit_gateway.this[0]: Refreshing state... [id=tgw-0b54c07ec6d0f4001]
module.transitgateway.data.aws_ec2_transit_gateway_vpc_attachment.this[0]: Refreshing state... [id=tgw-attach-0403a1a7b81e12413]
module.transitgateway.data.aws_ec2_transit_gateway_vpc_attachment.this[1]: Refreshing state... [id=tgw-attach-079a264ba5a86cf24]
module.transitgateway.data.aws_ec2_transit_gateway.this[0]: Refreshing state... [id=tgw-0b54c07ec6d0f4001]
module.transitgateway.aws_ec2_transit_gateway_route_table.this[0]: Refreshing state... [id=tgw-rtb-0de85792b3e415508]
module.transitgateway.data.aws_vpc.all_vpc_cidr[0]: Refreshing state... [id=vpc-c38256a5]
module.transitgateway.data.aws_vpc.all_vpc_cidr[1]: Refreshing state... [id=vpc-0c9cd8eed5980b262]
module.transitgateway.aws_ec2_transit_gateway_vpc_attachment.this[0]: Refreshing state... [id=tgw-attach-079a264ba5a86cf24]
module.transitgateway.aws_ec2_transit_gateway_vpc_attachment.this[1]: Refreshing state... [id=tgw-attach-0403a1a7b81e12413]
module.transitgateway.aws_route.without_destination_routes["vpc-0c9cd8eed5980b262.subnet-04a63935d18f0b311.172.31.0.0/16"]: Refreshing state... [id=r-rtb-0af206f562131c35d3854007479]
module.transitgateway.aws_route.with_destination_routes["vpc-c38256a5.subnet-5e78c138.10.10.144.0/20"]: Refreshing state... [id=r-rtb-f12b7397654175684]
module.transitgateway.aws_route.without_destination_routes["vpc-0c9cd8eed5980b262.subnet-040c7e4a784ed5f68.172.31.0.0/16"]: Refreshing state... [id=r-rtb-0756202060a1ad43e3854007479]
module.transitgateway.aws_route.with_destination_routes["vpc-c38256a5.subnet-5e78c138.10.10.128.0/20"]: Refreshing state... [id=r-rtb-f12b7397854530181]
module.transitgateway.aws_ec2_transit_gateway_route_table_propagation.this[1]: Refreshing state... [id=tgw-rtb-0de85792b3e415508_tgw-attach-0403a1a7b81e12413]
module.transitgateway.aws_ec2_transit_gateway_route_table_propagation.this[0]: Refreshing state... [id=tgw-rtb-0de85792b3e415508_tgw-attach-079a264ba5a86cf24]
module.transitgateway.aws_ec2_transit_gateway_route.default_cidr[1]: Refreshing state... [id=tgw-rtb-0de85792b3e415508_172.31.0.0/16]
module.transitgateway.aws_ec2_transit_gateway_route_table_association.this[0]: Refreshing state... [id=tgw-rtb-0de85792b3e415508_tgw-attach-079a264ba5a86cf24]
module.transitgateway.aws_ec2_transit_gateway_route_table_association.this[1]: Refreshing state... [id=tgw-rtb-0de85792b3e415508_tgw-attach-0403a1a7b81e12413]
module.transitgateway.aws_ec2_transit_gateway_route.default_cidr[0]: Refreshing state... [id=tgw-rtb-0de85792b3e415508_10.10.0.0/16]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.transitgateway.aws_route.with_destination_routes["vpc-0c9cd8eed5980b262.subnet-040c7e4a784ed5f68.172.31.32.0/20"] will be created
  + resource "aws_route" "with_destination_routes" {
      + destination_cidr_block = "172.31.32.0/20"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0756202060a1ad43e"
      + state                  = (known after apply)
      + transit_gateway_id     = "tgw-0b54c07ec6d0f4001"

      + timeouts {
          + create = "5m"
        }
    }

  # module.transitgateway.aws_route.with_destination_routes["vpc-0c9cd8eed5980b262.subnet-04a63935d18f0b311.172.31.32.0/20"] will be created
  + resource "aws_route" "with_destination_routes" {
      + destination_cidr_block = "172.31.32.0/20"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0af206f562131c35d"
      + state                  = (known after apply)
      + transit_gateway_id     = "tgw-0b54c07ec6d0f4001"

      + timeouts {
          + create = "5m"
        }
    }

  # module.transitgateway.aws_route.without_destination_routes["vpc-0c9cd8eed5980b262.subnet-040c7e4a784ed5f68.172.31.0.0/16"] will be destroyed
  - resource "aws_route" "without_destination_routes" {
      - destination_cidr_block = "172.31.0.0/16" -> null
      - id                     = "r-rtb-0756202060a1ad43e3854007479" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0756202060a1ad43e" -> null
      - state                  = "active" -> null
      - transit_gateway_id     = "tgw-0b54c07ec6d0f4001" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.transitgateway.aws_route.without_destination_routes["vpc-0c9cd8eed5980b262.subnet-04a63935d18f0b311.172.31.0.0/16"] will be destroyed
  - resource "aws_route" "without_destination_routes" {
      - destination_cidr_block = "172.31.0.0/16" -> null
      - id                     = "r-rtb-0af206f562131c35d3854007479" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0af206f562131c35d" -> null
      - state                  = "active" -> null
      - transit_gateway_id     = "tgw-0b54c07ec6d0f4001" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

*Pusher: @debu99, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*